---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegment.Above
source: html/c2f27fdb-7370-adba-5879-d21536423619.htm
---
# Autodesk.Revit.DB.DimensionSegment.Above Property

The text shown above the segment's value.

## Syntax (C#)
```csharp
public string Above { get; set; }
```